Диплом_сломан/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ПланГрафикаОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом_сломан/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//получим из параметров вдрес врем.хран.
	//ранее в форме владельце вторым параметром передавали струтуру с адресом,
	//куда выгрузили таблчную часть  док.график отпусков
	//ПередаваемыеПараметры = Новый Структура ("АдресВремХранилища", АдресВремХранилища);;
	АдресВременногоХранилища = Параметры.АдресВремХранилища;
	
	//получим из врем.хранилища таблицу с графиком отпусков
	ТабличнаяЧастьОтпуска = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	//обойдем табличную часть
	
	Для Каждого Строка Из ТабличнаяЧастьОтпуска Цикл
		Точка = ГрафикОтпусков.УстановитьТочку(Строка.Сотрудник, "Сотрудник");
		Точка.Текст = Строка.Сотрудник;
		
		Серия = ГрафикОтпусков.УстановитьСерию("Отпуск");
		
		Значение = ГрафикОтпусков.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
	КонецЦикла
	
КонецПроцедуры
#КонецОбласти
